app/controllers/admin/rssfeeds_controller.rb

SELECT * FROM "rssfeeds"
---
  def index
    @rssfeeds = Rssfeed.all