app/controllers/admin/sports_controller.rb

  def index
    @sports = Sport.all
---
SELECT * FROM "sports"