app/controllers/admin/stories_controller.rb

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT * FROM "stories" WHERE ("stories"."id" = 43)
DELETE FROM "stories" WHERE "id" = 43

  def fetch
    @rssfeed = Rssfeed.find(params[:id])
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 1)

  def save_fetched
     @rssfeed = Rssfeed.find(params[:id])
     fetched_stories = Feeder::Feeder.fetch(@rssfeed.url)
    # render params.inspect
     stories_to_accept = params[:accepted][:urls]

     stories_to_accept.each do |story_url|
        fetched_stories.each do |story|
          if story.url == story_url
              s = Story.new
              s.url = story.url
              s.summary = story.description
              s.title = story.title
              s.accepted = true
              s.accepted_at = Time.now
              s.sport = @rssfeed.sport
              s.original_publish_at = story.date_published
              s.save
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 2)
INSERT INTO "stories" ("accepted", "accepted_at", "updated_at", "title", "published", "url", "summary", "sport_id", "original_publish_at", "source_type", "published_at", "source", "created_at") VALUES(NULL, NULL, '2010-03-04 11:11:40', 'Dickason gets update from IPL''s security experts', NULL, 'http://www.cricinfo.com/ipl2010/content/story/450561.html?CMP=OTC-RSS', 'The concerns of the foreign players regarding security during the IPL seem to have eased with the league deciding to collaborate with the independent security expert appointed by the player unions from Australia, England and South Africa ', NULL, NULL, NULL, NULL, NULL, '2010-03-04 11:11:40')

  def publish
      @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 33)

  def save_published
     @story = Story.find(params[:id])
     social_tags = params[:social_tags][:tag]

     social_tags.each do |tag|

        social_tag = SocialTag.new
        social_tag.name = tag
        social_tag.sport = @story.sport
        social_tag.save

        @story.social_tags << social_tag


     end
     @story.published = true
     @story.published_at = Time.now
     @story.save
---
SELECT * FROM "stories" WHERE ("stories"."id" = 34)
SELECT * FROM "social_tags" WHERE (name = 'Todd Carney' AND sport_id='7') LIMIT 1
INSERT INTO "social_tags" ("name", "score", "updated_at", "total_votes", "sport_id", "created_at") VALUES('Todd Carney', NULL, '2010-03-27 11:20:55', NULL, 7, '2010-03-27 11:20:55')
UPDATE "stories" SET "published" = 't', "published_at" = '2010-03-11 05:28:19', "updated_at" = '2010-03-11 05:28:19' WHERE "id" = 35