app/controllers/dock/stories_controller.rb

  def vote

     story_tag = StoryTag.find(params[:id])
     sentiment = params[:choice]

     if sentiment == "up"
        sentiment =  1
     else
        sentiment =  -1
     end

     vote = Vote.new do |v|
          v.story = story_tag.story
          v.social_tag = story_tag.social_tag
          v.sentiment = sentiment
          v.sport = story_tag.sport
          v.story_tag = story_tag
     end

     vote.save
---
SELECT * FROM "story_tags" WHERE ("story_tags"."id" = 10)
INSERT INTO "votes" ("social_tag_id", "updated_at", "story_tag_id", "sentiment", "story_id", "sport_id", "created_at") VALUES(10, '2010-03-16 09:32:40', 10, 1, 44, NULL, '2010-03-16 09:32:40')