app/controllers/rssfeeds_controller.rb

  def index
    @rssfeeds = Rssfeed.all
---
SELECT * FROM "rssfeeds"

  def show
    @rssfeed = Rssfeed.find(params[:id])
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 1)

  def fetch
    @rssfeed = Rssfeed.find(params[:id])
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 1)

  def save_stories
     @rssfeed = Rssfeed.find(params[:id])
     stories = Feeder::Feeder.fetch(@rssfeed.url)
    # render params.inspect
     stories_to_save = params[:rssfeed][:urls]

     stories_to_save.each do |story_url|
        stories.each do |story|
          if story.url == story_url
              s = Story.new({:url=>story.url,:summary=>story.description,:title=>story.title })
              s.save
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 1)
INSERT INTO "stories" ("accepted", "accepted_at", "updated_at", "title", "published", "url", "summary", "sport_id", "source_type", "published_at", "source", "created_at") VALUES(NULL, NULL, '2010-03-03 05:56:23', 'Neville''s future on hold', NULL, 'http://www.premierleague.com/page/Headlines/0,,12306~1981252,00.html', 'Manchester United defender Gary Neville has shelved all thoughts about his future until the end of the season.', NULL, NULL, NULL, NULL, '2010-03-03 05:56:23')

  def edit
    @rssfeed = Rssfeed.find(params[:id])
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 1)

  def create
    @rssfeed = Rssfeed.new(params[:rssfeed])

    respond_to do |format|
      if @rssfeed.save
---
INSERT INTO "rssfeeds" ("name", "updated_at", "url", "last_fetched", "sport_id", "source", "frequnecy", "created_at") VALUES('Crickinfo - Australia', '2010-03-03 07:24:39', 'http://www.cricinfo.com/rss/content/story/feeds/2.xml', '2010-03-03 18:23:00', 2, 'http://www.cricinfo.com', '', '2010-03-03 07:24:39')

  def update
    @rssfeed = Rssfeed.find(params[:id])

    respond_to do |format|
      if @rssfeed.update_attributes(params[:rssfeed])
---
SELECT * FROM "rssfeeds" WHERE ("rssfeeds"."id" = 0)
UPDATE "rssfeeds" SET "source" = 'http://www.premierleague.com', "updated_at" = '2010-03-03 06:54:41' WHERE "id" = 1