app/controllers/social_tags_controller.rb

SELECT * FROM "social_tags" WHERE ("social_tags"."id" = 41)
---
  def show
    @social_tag = SocialTag.find(params[:id])