app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 44)
---
  def dock
    @story = Story.find(params[:id])