app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def edit
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
UPDATE "stories" SET "published" = 't', "accepted" = 't', "published_at" = '2010-03-03 17:14:00', "source_type" = '', "accepted_at" = '2010-03-03 17:14:00', "updated_at" = '2010-03-03 06:19:57' WHERE "id" = 1
---
  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])

SELECT * FROM "stories" WHERE ("stories"."id" = 29)
DELETE FROM "stories" WHERE "id" = 29
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy

SELECT * FROM "story_tags" WHERE ("story_tags"."id" = 10)
INSERT INTO "votes" ("social_tag_id", "updated_at", "story_tag_id", "sentiment", "story_id", "sport_id", "created_at") VALUES(12, '2010-03-14 04:46:50', 12, -1, 44, NULL, '2010-03-14 04:46:50')
---
  def vote

     story_tag = StoryTag.find(params[:id])
     sentiment = params[:choice]

     if sentiment == "up"
        sentiment =  1
     else
        sentiment =  -1
     end

     vote = Vote.new do |v|
          v.story = story_tag.story
          v.social_tag = story_tag.social_tag
          v.sentiment = sentiment
          v.sport = story_tag.sport
          v.story_tag = story_tag
     end

     vote.save

SELECT * FROM "stories" WHERE ("stories"."id" = 58)
---
  def opinion
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 58)
INSERT INTO "comments" ("updated_at", "member_id", "story_id", "opinion", "created_at") VALUES('2010-03-17 11:12:31', NULL, 58, NULL, '2010-03-17 11:12:31')
---
  def opinion_save
    @story = Story.find(params[:id])
    @story.comments.create({:story=>@story,:opinion=>params[:comment][:opinion]})