app/controllers/stories_controller.rb

  def index
    if params[:sport]
      sport = Sport.slug(params[:sport])
      @sport = sport.first
      #render " #{sport}"
      @stories = Story.published.sport(@sport.id)
    else
      @stories = Story.published.paginate :page => params[:page]
---
SELECT * FROM "sports"
SELECT * FROM "stories" WHERE ("stories"."sport_id" = 2171937640)